IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_cm_memorydiagerror_regs.xml
<module id="CM_MEMORYDIAGERROR_REGS" HW_revision="" description="CM MEMORYDIAGERROR Registers">
	<register id="DIAGERRFLG" width="32" page="1" offset="0x0" internal="0" description="Error Flag Register">
		<bitfield id="UCRDERROR" description="Diagnostics Uncorrectable Read Error Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="UCWRERROR" description="Diagnostics Uncorrectable Write Error Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CRDERROR" description="Diagnostics Correctable Read Error Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CWRERROR" description="Diagnostics Correctable Write Error Flag" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="DIAGERRCLR" width="32" page="1" offset="0x8" internal="0" description="Error Flag Clear Register">
		<bitfield id="UCRDERROR" description="Clear diagnostics uncorrectable Read Error Flag" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="UCWRERROR" description="Clear diagnostics uncorrectable Write Error Flag" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CRDERROR" description="Clear diagnostics correctable Read Error Flag" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CWRERROR" description="Clear diagnostics correctable Write Error Flag" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="DIAGERRADDR" width="32" page="1" offset="0xc" internal="0" description="Read Error Address">
		<bitfield id="EADDR" description="Diagnostics Error address register" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
